Revit.Elements.Roof.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],Revit.Elements.RoofType,Revit.Elements.Level)
Create a Revit Roof given its curve outline and Level
outline:
roofType:
level:
Returns: The Roof